ORDER_TYPE_MAP = {
    1: "普通订单", 2: "团购订单", 3: "周期购订单", 5: "预售订单",
    6: "定金膨胀订单", 7: "电子凭证订单", 10: "换新订单"
}

TRADE_TYPE_MAP = {
    1: "正常交易", 2: "货到付款", 3: "申样", 4: "随心购", 5: "虚拟资产"
}

MAIN_STATUS_MAP = {
    1: "待支付", 2: "待发货", 3: "已发货", 4: "已完成", 5: "已取消/关闭"
}

B_TYPE_MAP = {
    0: "站外", 1: "火山", 2: "抖音", 3: "头条", 4: "西瓜", 5: "微信", 
    6: "值点app", 7: "头条lite", 8: "懂车帝", 9: "皮皮虾", 11: "抖音极速版", 
    12: "TikTok", 13: "musically", 14: "穿山甲", 15: "火山极速版", 
    16: "服务市场", 26: "番茄小说", 27: "UG教育营销电商平台", 
    28: "Jumanji", 29: "电商SDK"
}

C_BIZ_MAP = {
    0: "未知", 1: "feeds流", 2: "搜索", 3: "个人主页", 4: "橱窗", 5: "直播间", 
    6: "商品详情页", 7: "内容侧", 8: "小时达主页", 9: "推荐页"
}

CANCEL_TYPE_MAP = {
    0: "无取消", 1: "用户申请", 2: "商家超时未发货", 3: "系统自动关闭", 
    4: "其他原因", 5: "未付款超时关闭", 6: "售后关闭"
}

BMP_SOURCE_MAP = {
    0: "普通", 1: "抖火", 2: "精选联盟", 3: "抖店", 4: "内容电商"
}

BMP_VERTICAL_MARKET_MAP = {
    0: "普通", 1: "服装", 2: "珠宝", 3: "酒水", 4: "美妆", 5: "图书"
}

BMP_SELLER_TYPE_MAP = {
    0: "普通商家", 1: "品牌", 2: "非品牌", 3: "旗舰店", 4: "专营店", 5: "专卖店"
}

SHOP_TYPE_MAP = {
    1: "个人店", 2: "企业店", 3: "旗舰店", 4: "专营店", 5: "专卖店"
}

DELIVERY_TYPE_MAP = {
    0: "无运力", 1: "快递（商家发货）", 2: "即时配送（商家自配）", 
    3: "即时配送（平台运力）", 4: "虚拟发货", 5: "自提"
}

LOGISTICS_SERVICE_TYPE_MAP = {
    1: "电子面单", 2: "上门取件", 3: "商家寄件", 4: "自配/无需物流"
}

SHIP_METHOD_MAP = {
    0: "无需发货/未知", 1: "商家发货", 2: "平台发货（代发）", 
    3: "电子凭证发码", 4: "自提"
}

PAY_TYPE_MAP = {
    1: "微信支付", 2: "支付宝支付", 4: "银行卡支付", 5: "余额",
    8: "抖音月付", 9: "新卡支付", 10: "抖音支付", 12: "先用后付",
    13: "组合支付", 14: "极速付", 19: "亲友卡支付（共享银行卡）",
    22: "聚合支付（以旧换新）", 27: "云闪付"
}

GOODS_TYPE_MAP = {
    0: "实体商品", 1: "虚拟商品", 2: "服务商品"
}

REDUCE_STOCK_TYPE_MAP = {
    1: "拍下减库存", 2: "支付减库存"
}

GIVEN_PRODUCT_TYPE_MAP = {
    0: "非赠品", 1: "赠品（无单独订单）", 2: "赠品（有单独订单）"
}

RECEIVE_TYPE_MAP = {
    1: "邮寄", 2: "自提"
}

AFTER_SALE_STATUS_MAP = {
    6: "售后申请",
    27: "拒绝售后申请",
    12: "售后成功",
    7: "售后退货中",
    11: "售后已发货",
    29: "售后退货拒绝",
    13: "换货/补寄待用户收货",
    14: "换货/补寄用户已收货",
    28: "售后失败",
    51: "订单取消成功",
    53: "逆向交易已完成",
    0: "无售后"
}

AFTER_SALE_TYPE_MAP = {
    0: "退货退款",
    1: "已发货仅退款",
    2: "未发货仅退款",
    3: "换货",
    4: "系统取消",
    5: "用户取消",
    6: "价保",
    7: "补寄",
}

REFUND_STATUS_MAP = {
    1: "待退款", 3: "退款成功", 4: "退款失败",
}

SELLER_REMARK_STRAS = {
    0: "灰", 1: "紫", 2: "青", 3: "绿", 4: "橙", 5: "红"   
}

DEFAULT_TABLE_NAMES = {
    "order": "ods_抖店_订单_全量",
    "aftersale": "ods_抖店_售后_全量",
    "settle": "ods_抖店_结算_全量"
}

API_CONFIG = {
    "base_url": "https://openapi-fxg.jinritemai.com",
    "version": "2",
    "sign_method": "hmac-sha256",
    "timeout": 20
}
